; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l18-t1-p2---int100n150-m25---int100c110---s427---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 l15 l16 l17 - location
t0 - truck
p0 p1 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level9 level9)
(sum level0 level10 level10)
(sum level0 level11 level11)
(sum level0 level12 level12)
(sum level0 level13 level13)
(sum level0 level14 level14)
(sum level0 level17 level17)
(sum level0 level18 level18)
(sum level0 level19 level19)
(sum level0 level20 level20)
(sum level0 level21 level21)
(sum level0 level23 level23)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level9 level10)
(sum level1 level10 level11)
(sum level1 level11 level12)
(sum level1 level12 level13)
(sum level1 level13 level14)
(sum level1 level14 level15)
(sum level1 level17 level18)
(sum level1 level18 level19)
(sum level1 level19 level20)
(sum level1 level20 level21)
(sum level1 level21 level22)
(sum level1 level23 level24)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level9 level11)
(sum level2 level10 level12)
(sum level2 level11 level13)
(sum level2 level12 level14)
(sum level2 level13 level15)
(sum level2 level14 level16)
(sum level2 level17 level19)
(sum level2 level18 level20)
(sum level2 level19 level21)
(sum level2 level20 level22)
(sum level2 level21 level23)
(sum level2 level23 level25)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level9 level12)
(sum level3 level10 level13)
(sum level3 level11 level14)
(sum level3 level12 level15)
(sum level3 level13 level16)
(sum level3 level14 level17)
(sum level3 level17 level20)
(sum level3 level18 level21)
(sum level3 level19 level22)
(sum level3 level20 level23)
(sum level3 level21 level24)
(sum level3 level23 level26)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level9 level13)
(sum level4 level10 level14)
(sum level4 level11 level15)
(sum level4 level12 level16)
(sum level4 level13 level17)
(sum level4 level14 level18)
(sum level4 level17 level21)
(sum level4 level18 level22)
(sum level4 level19 level23)
(sum level4 level20 level24)
(sum level4 level21 level25)
(sum level4 level23 level27)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level9 level14)
(sum level5 level10 level15)
(sum level5 level11 level16)
(sum level5 level12 level17)
(sum level5 level13 level18)
(sum level5 level14 level19)
(sum level5 level17 level22)
(sum level5 level18 level23)
(sum level5 level19 level24)
(sum level5 level20 level25)
(sum level5 level21 level26)
(sum level5 level23 level28)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level9 level15)
(sum level6 level10 level16)
(sum level6 level11 level17)
(sum level6 level12 level18)
(sum level6 level13 level19)
(sum level6 level14 level20)
(sum level6 level17 level23)
(sum level6 level18 level24)
(sum level6 level19 level25)
(sum level6 level20 level26)
(sum level6 level21 level27)
(sum level6 level23 level29)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level9 level16)
(sum level7 level10 level17)
(sum level7 level11 level18)
(sum level7 level12 level19)
(sum level7 level13 level20)
(sum level7 level14 level21)
(sum level7 level17 level24)
(sum level7 level18 level25)
(sum level7 level19 level26)
(sum level7 level20 level27)
(sum level7 level21 level28)
(sum level7 level23 level30)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level9 level17)
(sum level8 level10 level18)
(sum level8 level11 level19)
(sum level8 level12 level20)
(sum level8 level13 level21)
(sum level8 level14 level22)
(sum level8 level17 level25)
(sum level8 level18 level26)
(sum level8 level19 level27)
(sum level8 level20 level28)
(sum level8 level21 level29)
(sum level8 level23 level31)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level9 level18)
(sum level9 level10 level19)
(sum level9 level11 level20)
(sum level9 level12 level21)
(sum level9 level13 level22)
(sum level9 level14 level23)
(sum level9 level17 level26)
(sum level9 level18 level27)
(sum level9 level19 level28)
(sum level9 level20 level29)
(sum level9 level21 level30)
(sum level9 level23 level32)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level9 level19)
(sum level10 level10 level20)
(sum level10 level11 level21)
(sum level10 level12 level22)
(sum level10 level13 level23)
(sum level10 level14 level24)
(sum level10 level17 level27)
(sum level10 level18 level28)
(sum level10 level19 level29)
(sum level10 level20 level30)
(sum level10 level21 level31)
(sum level10 level23 level33)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level9 level20)
(sum level11 level10 level21)
(sum level11 level11 level22)
(sum level11 level12 level23)
(sum level11 level13 level24)
(sum level11 level14 level25)
(sum level11 level17 level28)
(sum level11 level18 level29)
(sum level11 level19 level30)
(sum level11 level20 level31)
(sum level11 level21 level32)
(sum level11 level23 level34)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level9 level21)
(sum level12 level10 level22)
(sum level12 level11 level23)
(sum level12 level12 level24)
(sum level12 level13 level25)
(sum level12 level14 level26)
(sum level12 level17 level29)
(sum level12 level18 level30)
(sum level12 level19 level31)
(sum level12 level20 level32)
(sum level12 level21 level33)
(sum level12 level23 level35)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level9 level22)
(sum level13 level10 level23)
(sum level13 level11 level24)
(sum level13 level12 level25)
(sum level13 level13 level26)
(sum level13 level14 level27)
(sum level13 level17 level30)
(sum level13 level18 level31)
(sum level13 level19 level32)
(sum level13 level20 level33)
(sum level13 level21 level34)
(sum level13 level23 level36)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level9 level23)
(sum level14 level10 level24)
(sum level14 level11 level25)
(sum level14 level12 level26)
(sum level14 level13 level27)
(sum level14 level14 level28)
(sum level14 level17 level31)
(sum level14 level18 level32)
(sum level14 level19 level33)
(sum level14 level20 level34)
(sum level14 level21 level35)
(sum level14 level23 level37)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level9 level24)
(sum level15 level10 level25)
(sum level15 level11 level26)
(sum level15 level12 level27)
(sum level15 level13 level28)
(sum level15 level14 level29)
(sum level15 level17 level32)
(sum level15 level18 level33)
(sum level15 level19 level34)
(sum level15 level20 level35)
(sum level15 level21 level36)
(sum level15 level23 level38)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level9 level25)
(sum level16 level10 level26)
(sum level16 level11 level27)
(sum level16 level12 level28)
(sum level16 level13 level29)
(sum level16 level14 level30)
(sum level16 level17 level33)
(sum level16 level18 level34)
(sum level16 level19 level35)
(sum level16 level20 level36)
(sum level16 level21 level37)
(sum level16 level23 level39)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level9 level26)
(sum level17 level10 level27)
(sum level17 level11 level28)
(sum level17 level12 level29)
(sum level17 level13 level30)
(sum level17 level14 level31)
(sum level17 level17 level34)
(sum level17 level18 level35)
(sum level17 level19 level36)
(sum level17 level20 level37)
(sum level17 level21 level38)
(sum level17 level23 level40)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level9 level27)
(sum level18 level10 level28)
(sum level18 level11 level29)
(sum level18 level12 level30)
(sum level18 level13 level31)
(sum level18 level14 level32)
(sum level18 level17 level35)
(sum level18 level18 level36)
(sum level18 level19 level37)
(sum level18 level20 level38)
(sum level18 level21 level39)
(sum level18 level23 level41)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level9 level28)
(sum level19 level10 level29)
(sum level19 level11 level30)
(sum level19 level12 level31)
(sum level19 level13 level32)
(sum level19 level14 level33)
(sum level19 level17 level36)
(sum level19 level18 level37)
(sum level19 level19 level38)
(sum level19 level20 level39)
(sum level19 level21 level40)
(sum level19 level23 level42)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level9 level29)
(sum level20 level10 level30)
(sum level20 level11 level31)
(sum level20 level12 level32)
(sum level20 level13 level33)
(sum level20 level14 level34)
(sum level20 level17 level37)
(sum level20 level18 level38)
(sum level20 level19 level39)
(sum level20 level20 level40)
(sum level20 level21 level41)
(sum level20 level23 level43)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level9 level30)
(sum level21 level10 level31)
(sum level21 level11 level32)
(sum level21 level12 level33)
(sum level21 level13 level34)
(sum level21 level14 level35)
(sum level21 level17 level38)
(sum level21 level18 level39)
(sum level21 level19 level40)
(sum level21 level20 level41)
(sum level21 level21 level42)
(sum level21 level23 level44)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level9 level31)
(sum level22 level10 level32)
(sum level22 level11 level33)
(sum level22 level12 level34)
(sum level22 level13 level35)
(sum level22 level14 level36)
(sum level22 level17 level39)
(sum level22 level18 level40)
(sum level22 level19 level41)
(sum level22 level20 level42)
(sum level22 level21 level43)
(sum level22 level23 level45)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level9 level32)
(sum level23 level10 level33)
(sum level23 level11 level34)
(sum level23 level12 level35)
(sum level23 level13 level36)
(sum level23 level14 level37)
(sum level23 level17 level40)
(sum level23 level18 level41)
(sum level23 level19 level42)
(sum level23 level20 level43)
(sum level23 level21 level44)
(sum level23 level23 level46)
(sum level24 level1 level25)
(sum level24 level2 level26)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level9 level33)
(sum level24 level10 level34)
(sum level24 level11 level35)
(sum level24 level12 level36)
(sum level24 level13 level37)
(sum level24 level14 level38)
(sum level24 level17 level41)
(sum level24 level18 level42)
(sum level24 level19 level43)
(sum level24 level20 level44)
(sum level24 level21 level45)
(sum level24 level23 level47)
(sum level25 level1 level26)
(sum level25 level2 level27)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level9 level34)
(sum level25 level10 level35)
(sum level25 level11 level36)
(sum level25 level12 level37)
(sum level25 level13 level38)
(sum level25 level14 level39)
(sum level25 level17 level42)
(sum level25 level18 level43)
(sum level25 level19 level44)
(sum level25 level20 level45)
(sum level25 level21 level46)
(sum level25 level23 level48)
(sum level26 level1 level27)
(sum level26 level2 level28)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level9 level35)
(sum level26 level10 level36)
(sum level26 level11 level37)
(sum level26 level12 level38)
(sum level26 level13 level39)
(sum level26 level14 level40)
(sum level26 level17 level43)
(sum level26 level18 level44)
(sum level26 level19 level45)
(sum level26 level20 level46)
(sum level26 level21 level47)
(sum level26 level23 level49)
(sum level27 level1 level28)
(sum level27 level2 level29)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level9 level36)
(sum level27 level10 level37)
(sum level27 level11 level38)
(sum level27 level12 level39)
(sum level27 level13 level40)
(sum level27 level14 level41)
(sum level27 level17 level44)
(sum level27 level18 level45)
(sum level27 level19 level46)
(sum level27 level20 level47)
(sum level27 level21 level48)
(sum level27 level23 level50)
(sum level28 level1 level29)
(sum level28 level2 level30)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level9 level37)
(sum level28 level10 level38)
(sum level28 level11 level39)
(sum level28 level12 level40)
(sum level28 level13 level41)
(sum level28 level14 level42)
(sum level28 level17 level45)
(sum level28 level18 level46)
(sum level28 level19 level47)
(sum level28 level20 level48)
(sum level28 level21 level49)
(sum level28 level23 level51)
(sum level29 level1 level30)
(sum level29 level2 level31)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level29 level9 level38)
(sum level29 level10 level39)
(sum level29 level11 level40)
(sum level29 level12 level41)
(sum level29 level13 level42)
(sum level29 level14 level43)
(sum level29 level17 level46)
(sum level29 level18 level47)
(sum level29 level19 level48)
(sum level29 level20 level49)
(sum level29 level21 level50)
(sum level29 level23 level52)
(sum level30 level1 level31)
(sum level30 level2 level32)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level30 level9 level39)
(sum level30 level10 level40)
(sum level30 level11 level41)
(sum level30 level12 level42)
(sum level30 level13 level43)
(sum level30 level14 level44)
(sum level30 level17 level47)
(sum level30 level18 level48)
(sum level30 level19 level49)
(sum level30 level20 level50)
(sum level30 level21 level51)
(sum level30 level23 level53)
(sum level31 level1 level32)
(sum level31 level2 level33)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level31 level9 level40)
(sum level31 level10 level41)
(sum level31 level11 level42)
(sum level31 level12 level43)
(sum level31 level13 level44)
(sum level31 level14 level45)
(sum level31 level17 level48)
(sum level31 level18 level49)
(sum level31 level19 level50)
(sum level31 level20 level51)
(sum level31 level21 level52)
(sum level31 level23 level54)
(sum level32 level1 level33)
(sum level32 level2 level34)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level32 level9 level41)
(sum level32 level10 level42)
(sum level32 level11 level43)
(sum level32 level12 level44)
(sum level32 level13 level45)
(sum level32 level14 level46)
(sum level32 level17 level49)
(sum level32 level18 level50)
(sum level32 level19 level51)
(sum level32 level20 level52)
(sum level32 level21 level53)
(sum level32 level23 level55)
(sum level33 level1 level34)
(sum level33 level2 level35)
(sum level33 level4 level37)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level33 level9 level42)
(sum level33 level10 level43)
(sum level33 level11 level44)
(sum level33 level12 level45)
(sum level33 level13 level46)
(sum level33 level14 level47)
(sum level33 level17 level50)
(sum level33 level18 level51)
(sum level33 level19 level52)
(sum level33 level20 level53)
(sum level33 level21 level54)
(sum level33 level23 level56)
(sum level34 level1 level35)
(sum level34 level2 level36)
(sum level34 level4 level38)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level34 level9 level43)
(sum level34 level10 level44)
(sum level34 level11 level45)
(sum level34 level12 level46)
(sum level34 level13 level47)
(sum level34 level14 level48)
(sum level34 level17 level51)
(sum level34 level18 level52)
(sum level34 level19 level53)
(sum level34 level20 level54)
(sum level34 level21 level55)
(sum level34 level23 level57)
(sum level35 level1 level36)
(sum level35 level2 level37)
(sum level35 level4 level39)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level35 level9 level44)
(sum level35 level10 level45)
(sum level35 level11 level46)
(sum level35 level12 level47)
(sum level35 level13 level48)
(sum level35 level14 level49)
(sum level35 level17 level52)
(sum level35 level18 level53)
(sum level35 level19 level54)
(sum level35 level20 level55)
(sum level35 level21 level56)
(sum level35 level23 level58)
(sum level36 level1 level37)
(sum level36 level2 level38)
(sum level36 level4 level40)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level36 level9 level45)
(sum level36 level10 level46)
(sum level36 level11 level47)
(sum level36 level12 level48)
(sum level36 level13 level49)
(sum level36 level14 level50)
(sum level36 level17 level53)
(sum level36 level18 level54)
(sum level36 level19 level55)
(sum level36 level20 level56)
(sum level36 level21 level57)
(sum level36 level23 level59)
(sum level37 level1 level38)
(sum level37 level2 level39)
(sum level37 level4 level41)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level37 level9 level46)
(sum level37 level10 level47)
(sum level37 level11 level48)
(sum level37 level12 level49)
(sum level37 level13 level50)
(sum level37 level14 level51)
(sum level37 level17 level54)
(sum level37 level18 level55)
(sum level37 level19 level56)
(sum level37 level20 level57)
(sum level37 level21 level58)
(sum level37 level23 level60)
(sum level38 level1 level39)
(sum level38 level2 level40)
(sum level38 level4 level42)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level38 level9 level47)
(sum level38 level10 level48)
(sum level38 level11 level49)
(sum level38 level12 level50)
(sum level38 level13 level51)
(sum level38 level14 level52)
(sum level38 level17 level55)
(sum level38 level18 level56)
(sum level38 level19 level57)
(sum level38 level20 level58)
(sum level38 level21 level59)
(sum level38 level23 level61)
(sum level39 level1 level40)
(sum level39 level2 level41)
(sum level39 level4 level43)
(sum level39 level5 level44)
(sum level39 level6 level45)
(sum level39 level9 level48)
(sum level39 level10 level49)
(sum level39 level11 level50)
(sum level39 level12 level51)
(sum level39 level13 level52)
(sum level39 level14 level53)
(sum level39 level17 level56)
(sum level39 level18 level57)
(sum level39 level19 level58)
(sum level39 level20 level59)
(sum level39 level21 level60)
(sum level39 level23 level62)
(sum level40 level1 level41)
(sum level40 level2 level42)
(sum level40 level4 level44)
(sum level40 level5 level45)
(sum level40 level6 level46)
(sum level40 level9 level49)
(sum level40 level10 level50)
(sum level40 level11 level51)
(sum level40 level12 level52)
(sum level40 level13 level53)
(sum level40 level14 level54)
(sum level40 level17 level57)
(sum level40 level18 level58)
(sum level40 level19 level59)
(sum level40 level20 level60)
(sum level40 level21 level61)
(sum level41 level1 level42)
(sum level41 level2 level43)
(sum level41 level4 level45)
(sum level41 level5 level46)
(sum level41 level6 level47)
(sum level41 level9 level50)
(sum level41 level10 level51)
(sum level41 level11 level52)
(sum level41 level12 level53)
(sum level41 level13 level54)
(sum level41 level14 level55)
(sum level41 level17 level58)
(sum level41 level18 level59)
(sum level41 level19 level60)
(sum level41 level20 level61)
(sum level41 level21 level62)
(sum level42 level1 level43)
(sum level42 level2 level44)
(sum level42 level4 level46)
(sum level42 level5 level47)
(sum level42 level6 level48)
(sum level42 level9 level51)
(sum level42 level10 level52)
(sum level42 level11 level53)
(sum level42 level12 level54)
(sum level42 level13 level55)
(sum level42 level14 level56)
(sum level42 level17 level59)
(sum level42 level18 level60)
(sum level42 level19 level61)
(sum level42 level20 level62)
(sum level43 level1 level44)
(sum level43 level2 level45)
(sum level43 level4 level47)
(sum level43 level5 level48)
(sum level43 level6 level49)
(sum level43 level9 level52)
(sum level43 level10 level53)
(sum level43 level11 level54)
(sum level43 level12 level55)
(sum level43 level13 level56)
(sum level43 level14 level57)
(sum level43 level17 level60)
(sum level43 level18 level61)
(sum level43 level19 level62)
(sum level44 level1 level45)
(sum level44 level2 level46)
(sum level44 level4 level48)
(sum level44 level5 level49)
(sum level44 level6 level50)
(sum level44 level9 level53)
(sum level44 level10 level54)
(sum level44 level11 level55)
(sum level44 level12 level56)
(sum level44 level13 level57)
(sum level44 level14 level58)
(sum level44 level17 level61)
(sum level44 level18 level62)
(sum level45 level1 level46)
(sum level45 level2 level47)
(sum level45 level4 level49)
(sum level45 level5 level50)
(sum level45 level6 level51)
(sum level45 level9 level54)
(sum level45 level10 level55)
(sum level45 level11 level56)
(sum level45 level12 level57)
(sum level45 level13 level58)
(sum level45 level14 level59)
(sum level45 level17 level62)
(sum level46 level1 level47)
(sum level46 level2 level48)
(sum level46 level4 level50)
(sum level46 level5 level51)
(sum level46 level6 level52)
(sum level46 level9 level55)
(sum level46 level10 level56)
(sum level46 level11 level57)
(sum level46 level12 level58)
(sum level46 level13 level59)
(sum level46 level14 level60)
(sum level47 level1 level48)
(sum level47 level2 level49)
(sum level47 level4 level51)
(sum level47 level5 level52)
(sum level47 level6 level53)
(sum level47 level9 level56)
(sum level47 level10 level57)
(sum level47 level11 level58)
(sum level47 level12 level59)
(sum level47 level13 level60)
(sum level47 level14 level61)
(sum level48 level1 level49)
(sum level48 level2 level50)
(sum level48 level4 level52)
(sum level48 level5 level53)
(sum level48 level6 level54)
(sum level48 level9 level57)
(sum level48 level10 level58)
(sum level48 level11 level59)
(sum level48 level12 level60)
(sum level48 level13 level61)
(sum level48 level14 level62)
(sum level49 level1 level50)
(sum level49 level2 level51)
(sum level49 level4 level53)
(sum level49 level5 level54)
(sum level49 level6 level55)
(sum level49 level9 level58)
(sum level49 level10 level59)
(sum level49 level11 level60)
(sum level49 level12 level61)
(sum level49 level13 level62)
(sum level50 level1 level51)
(sum level50 level2 level52)
(sum level50 level4 level54)
(sum level50 level5 level55)
(sum level50 level6 level56)
(sum level50 level9 level59)
(sum level50 level10 level60)
(sum level50 level11 level61)
(sum level50 level12 level62)
(sum level51 level1 level52)
(sum level51 level2 level53)
(sum level51 level4 level55)
(sum level51 level5 level56)
(sum level51 level6 level57)
(sum level51 level9 level60)
(sum level51 level10 level61)
(sum level51 level11 level62)
(sum level52 level1 level53)
(sum level52 level2 level54)
(sum level52 level4 level56)
(sum level52 level5 level57)
(sum level52 level6 level58)
(sum level52 level9 level61)
(sum level52 level10 level62)
(sum level53 level1 level54)
(sum level53 level2 level55)
(sum level53 level4 level57)
(sum level53 level5 level58)
(sum level53 level6 level59)
(sum level53 level9 level62)
(sum level54 level1 level55)
(sum level54 level2 level56)
(sum level54 level4 level58)
(sum level54 level5 level59)
(sum level54 level6 level60)
(sum level55 level1 level56)
(sum level55 level2 level57)
(sum level55 level4 level59)
(sum level55 level5 level60)
(sum level55 level6 level61)
(sum level56 level1 level57)
(sum level56 level2 level58)
(sum level56 level4 level60)
(sum level56 level5 level61)
(sum level56 level6 level62)
(sum level57 level1 level58)
(sum level57 level2 level59)
(sum level57 level4 level61)
(sum level57 level5 level62)
(sum level58 level1 level59)
(sum level58 level2 level60)
(sum level58 level4 level62)
(sum level59 level1 level60)
(sum level59 level2 level61)
(sum level60 level1 level61)
(sum level60 level2 level62)
(sum level61 level1 level62)

(connected l0 l3)
(fuelcost level12 l0 l3)
(connected l0 l8)
(fuelcost level18 l0 l8)
(connected l0 l17)
(fuelcost level12 l0 l17)
(connected l1 l3)
(fuelcost level14 l1 l3)
(connected l2 l16)
(fuelcost level4 l2 l16)
(connected l3 l0)
(fuelcost level12 l3 l0)
(connected l3 l1)
(fuelcost level14 l3 l1)
(connected l3 l5)
(fuelcost level2 l3 l5)
(connected l3 l8)
(fuelcost level23 l3 l8)
(connected l3 l9)
(fuelcost level1 l3 l9)
(connected l3 l13)
(fuelcost level17 l3 l13)
(connected l4 l6)
(fuelcost level2 l4 l6)
(connected l5 l3)
(fuelcost level2 l5 l3)
(connected l5 l6)
(fuelcost level21 l5 l6)
(connected l5 l7)
(fuelcost level13 l5 l7)
(connected l5 l9)
(fuelcost level6 l5 l9)
(connected l5 l10)
(fuelcost level13 l5 l10)
(connected l5 l14)
(fuelcost level19 l5 l14)
(connected l5 l16)
(fuelcost level21 l5 l16)
(connected l6 l4)
(fuelcost level2 l6 l4)
(connected l6 l5)
(fuelcost level21 l6 l5)
(connected l6 l7)
(fuelcost level9 l6 l7)
(connected l6 l8)
(fuelcost level4 l6 l8)
(connected l6 l10)
(fuelcost level5 l6 l10)
(connected l7 l5)
(fuelcost level13 l7 l5)
(connected l7 l6)
(fuelcost level9 l7 l6)
(connected l7 l13)
(fuelcost level19 l7 l13)
(connected l8 l0)
(fuelcost level18 l8 l0)
(connected l8 l3)
(fuelcost level23 l8 l3)
(connected l8 l6)
(fuelcost level4 l8 l6)
(connected l8 l13)
(fuelcost level20 l8 l13)
(connected l9 l3)
(fuelcost level1 l9 l3)
(connected l9 l5)
(fuelcost level6 l9 l5)
(connected l9 l11)
(fuelcost level23 l9 l11)
(connected l9 l13)
(fuelcost level11 l9 l13)
(connected l9 l15)
(fuelcost level10 l9 l15)
(connected l10 l5)
(fuelcost level13 l10 l5)
(connected l10 l6)
(fuelcost level5 l10 l6)
(connected l10 l14)
(fuelcost level23 l10 l14)
(connected l11 l9)
(fuelcost level23 l11 l9)
(connected l12 l13)
(fuelcost level5 l12 l13)
(connected l13 l3)
(fuelcost level17 l13 l3)
(connected l13 l7)
(fuelcost level19 l13 l7)
(connected l13 l8)
(fuelcost level20 l13 l8)
(connected l13 l9)
(fuelcost level11 l13 l9)
(connected l13 l12)
(fuelcost level5 l13 l12)
(connected l14 l5)
(fuelcost level19 l14 l5)
(connected l14 l10)
(fuelcost level23 l14 l10)
(connected l15 l9)
(fuelcost level10 l15 l9)
(connected l16 l2)
(fuelcost level4 l16 l2)
(connected l16 l5)
(fuelcost level21 l16 l5)
(connected l16 l17)
(fuelcost level9 l16 l17)
(connected l17 l0)
(fuelcost level12 l17 l0)
(connected l17 l16)
(fuelcost level9 l17 l16)

(at t0 l9)
(fuel t0 level62)
(= (total-cost) 0)

(at p0 l14)
(at p1 l5)
)

(:goal
(and
(at p0 l9)
(at p1 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l9 l3 level61 level1 level62)
   deleted: (at t0 l9) (fuel t0 level62)
   added: (at t0 l3) (fuel t0 level61)
   goals met: 0 of 2
2. (drive t0 l3 l5 level59 level2 level61)
   deleted: (at t0 l3) (fuel t0 level61)
   added: (at t0 l5) (fuel t0 level59)
   goals met: 0 of 2
3. (load p1 t0 l5)
   deleted: (at p1 l5)
   added: (in p1 t0)
   goals met: 0 of 2
4. (drive t0 l5 l14 level40 level19 level59)
   deleted: (at t0 l5) (fuel t0 level59)
   added: (at t0 l14) (fuel t0 level40)
   goals met: 0 of 2
5. (load p0 t0 l14)
   deleted: (at p0 l14)
   added: (in p0 t0)
   goals met: 0 of 2
6. (drive t0 l14 l5 level21 level19 level40)
   deleted: (at t0 l14) (fuel t0 level40)
   added: (at t0 l5) (fuel t0 level21)
   goals met: 0 of 2
7. (drive t0 l5 l9 level15 level6 level21)
   deleted: (at t0 l5) (fuel t0 level21)
   added: (at t0 l9) (fuel t0 level15)
   goals met: 0 of 2
8. (unload p0 t0 l9)
   deleted: (in p0 t0)
   added: (at p0 l9)
   goals met: 1 of 2
9. (drive t0 l9 l3 level14 level1 level15)
   deleted: (at t0 l9) (fuel t0 level15)
   added: (at t0 l3) (fuel t0 level14)
   goals met: 1 of 2
10. (drive t0 l3 l0 level2 level12 level14)
   deleted: (at t0 l3) (fuel t0 level14)
   added: (at t0 l0) (fuel t0 level2)
   goals met: 1 of 2
11. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 2 of 2
